# FilteredElementCollector Properties

---
The FilteredElementCollector type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace